; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	infrared1 - mode
	spectrograph2 - mode
	spectrograph3 - mode
	thermograph4 - mode
	thermograph0 - mode
	GroundStation2 - direction
	Star4 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	Star6 - direction
	GroundStation5 - direction
	Star1 - direction
	GroundStation7 - direction
	Star3 - direction
	GroundStation0 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 spectrograph3)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation7)
	(supports instrument4 thermograph4)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
)
(:goal (and
	(have_image Phenomenon10 spectrograph3)
	(have_image Star11 spectrograph3)
	(have_image Planet12 thermograph0)
	(have_image Planet13 spectrograph3)
	(have_image Phenomenon14 spectrograph3)
	(have_image Phenomenon15 spectrograph3)
	(have_image Planet16 thermograph0)
))

)

; plan
1. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 7
2. (calibrate satellite1 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 0 of 7
3. (turn_to satellite1 planet16 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet16)
   goals met: 0 of 7
4. (take_image satellite1 planet16 instrument4 thermograph0)
   added: (have_image planet16 thermograph0)
   goals met: 1 of 7
5. (turn_to satellite1 planet12 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet12)
   goals met: 1 of 7
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
7. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 1 of 7
8. (take_image satellite1 planet12 instrument4 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 2 of 7
9. (turn_to satellite0 phenomenon10 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 7
10. (take_image satellite0 phenomenon10 instrument0 spectrograph3)
   added: (have_image phenomenon10 spectrograph3)
   goals met: 3 of 7
11. (turn_to satellite0 phenomenon14 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 7
12. (take_image satellite0 phenomenon14 instrument0 spectrograph3)
   added: (have_image phenomenon14 spectrograph3)
   goals met: 4 of 7
13. (turn_to satellite0 phenomenon15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon15)
   goals met: 4 of 7
14. (take_image satellite0 phenomenon15 instrument0 spectrograph3)
   added: (have_image phenomenon15 spectrograph3)
   goals met: 5 of 7
15. (turn_to satellite0 planet13 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet13)
   goals met: 5 of 7
16. (take_image satellite0 planet13 instrument0 spectrograph3)
   added: (have_image planet13 spectrograph3)
   goals met: 6 of 7
17. (turn_to satellite0 star11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star11)
   goals met: 6 of 7
18. (take_image satellite0 star11 instrument0 spectrograph3)
   added: (have_image star11 spectrograph3)
   goals met: 7 of 7
